## 数值运算操作

In [1]:
import pandas as pd
df = pd.DataFrame([[1,2,3], [4,5,6]], index = ['a', 'b'], columns = ['A', 'B', 'C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [2]:
df.sum()

A    5
B    7
C    9
dtype: int64

In [3]:
df.sum(axis=0)

A    5
B    7
C    9
dtype: int64

In [4]:
df.sum(axis=1)

a     6
b    15
dtype: int64

In [5]:
df.sum(axis='columns')

a     6
b    15
dtype: int64

In [6]:
df.mean(axis='columns')

a    2.0
b    5.0
dtype: float64

In [7]:
print(df.min(),df.max(),df.median())

A    1
B    2
C    3
dtype: int64 A    4
B    5
C    6
dtype: int64 A    2.5
B    3.5
C    4.5
dtype: float64

## 二元统计

In [8]:
df = pd.read_csv('./data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.cov()  # 协方差

C:\Users\prl\AppData\Local\Temp\ipykernel_9000\1789214202.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()  # 协方差

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [10]:
df.corr()  # 相关系数

C:\Users\prl\AppData\Local\Temp\ipykernel_9000\1401037526.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()  # 相关系数

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [11]:
df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [12]:
df['Age'].value_counts(ascending = True, bins=5)  # bins 自动分组

(64.084, 80.0]       11
(48.168, 64.084]     69
(0.339, 16.336]     100
(32.252, 48.168]    188
(16.336, 32.252]    346
Name: Age, dtype: int64

In [13]:
df['Pclass'].value_counts(ascending=True)

2    184
1    216
3    491
Name: Pclass, dtype: int64

In [14]:
df['Age'].count()

714

In [15]:
df['Pclass'].count()

891

## 对象操作
### series结构的对象的增删改查

In [16]:
data = [10,11,12]
index = ['a', 'b', 'c']
s = pd.Series(data= data, index= index)
s

a    10
b    11
c    12
dtype: int64

查操作

In [17]:
mask = [True, False, True]
s[mask]

a    10
c    12
dtype: int64

In [18]:
s.loc['b']

11

In [19]:
s.iloc[1]

11

改操作

In [20]:
s1 = s.copy()
s1['a'] = 100
s1

a    100
b     11
c     12
dtype: int64

In [21]:
s1.replace(to_replace = 100, value = 101, inplace = False)

a    101
b     11
c     12
dtype: int64

In [22]:
s1 # inplace = False 原数不改变

a    100
b     11
c     12
dtype: int64

In [23]:
s1.replace(to_replace = 100, value = 101, inplace = True)

In [24]:
s1

a    101
b     11
c     12
dtype: int64

In [25]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
s1.index = ['a', 'b', 'd']
s1

a    101
b     11
d     12
dtype: int64

In [27]:
s1.rename(index={'a':'A'},inplace=True)
s1

A    101
b     11
d     12
dtype: int64

增操作

In [28]:
s2 = pd.Series([100,110],index=['g','h'])
s2

g    100
h    110
dtype: int64

In [29]:
s3 = pd.concat([s1, s2], ignore_index=False)
s3

A    101
b     11
d     12
g    100
h    110
dtype: int64

In [30]:
s3['d'] = 500
s3

A    101
b     11
d    500
g    100
h    110
dtype: int64

In [31]:
s3 = pd.concat([s1, s2], ignore_index=True)  # 修改索引
s3

0    101
1     11
2     12
3    100
4    110
dtype: int64

删除操作

In [32]:
s1

A    101
b     11
d     12
dtype: int64

In [33]:
del s1['A']
s1

b    11
d    12
dtype: int64

In [34]:
s1.drop(['b', 'd'], inplace=True)
s1

Series([], dtype: int64)

### DataFrame结构的增删改查

In [35]:
data = [[1,2,3],[4,5,6]]
index = ['a','b']
columns = ['A', 'B', 'C']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

   A  B  C
a  1  2  3
b  4  5  6

查操作

In [36]:
df['A']

a    1
b    4
Name: A, dtype: int64

In [37]:
df.iloc[0]  # iloc中的i for index. 这个Index是它内部的那个index，比如说，这里的0对应的就是'a'

A    1
B    2
C    3
Name: a, dtype: int64

In [38]:
df.loc['a']

A    1
B    2
C    3
Name: a, dtype: int64

In [39]:
df.loc['a']['A']

1

改操作

In [40]:
df.loc['a']['A']

1

In [41]:
df.loc['a']['A'] = 105
df

     A  B  C
a  105  2  3
b    4  5  6

In [42]:
df.index = ['f', 'g']
df

     A  B  C
f  105  2  3
g    4  5  6

增操作

In [43]:
df.loc['c'] = [1, 2, 3]
df

     A  B  C
f  105  2  3
g    4  5  6
c    1  2  3

In [44]:
data = [[1,2,3],[4,5,6]]
index = ['j','k']
columns = ['A', 'B', 'C']

df2 = pd.DataFrame(data=data, index=index, columns=columns)
df2

   A  B  C
j  1  2  3
k  4  5  6

In [45]:
df3 = pd.concat([df, df2])
df3

     A  B  C
f  105  2  3
g    4  5  6
c    1  2  3
j    1  2  3
k    4  5  6

In [46]:
df3 = pd.concat([df, df2], axis=1)
df3

       A    B    C    A    B    C
f  105.0  2.0  3.0  NaN  NaN  NaN
g    4.0  5.0  6.0  NaN  NaN  NaN
c    1.0  2.0  3.0  NaN  NaN  NaN
j    NaN  NaN  NaN  1.0  2.0  3.0
k    NaN  NaN  NaN  4.0  5.0  6.0

In [47]:
df2['pu'] = [1,2]
df2

   A  B  C  pu
j  1  2  3   1
k  4  5  6   2

In [48]:
df4 = pd.DataFrame([[10,11],[12,13]],index=['j','k'],columns=['D','E'])
df4

    D   E
j  10  11
k  12  13

In [49]:
df5 = pd.concat([df4,df2], axis=1)
df5

    D   E  A  B  C  pu
j  10  11  1  2  3   1
k  12  13  4  5  6   2

删操作

In [50]:
df5.drop(['j'],axis=0,inplace=True)
df5

    D   E  A  B  C  pu
k  12  13  4  5  6   2

In [51]:
del df5['pu']
df5

    D   E  A  B  C
k  12  13  4  5  6

In [52]:
df5.drop(['A','B'],axis=1,inplace=True)
df5

    D   E  C
k  12  13  6